In [48]:
import pandas as pd
import numpy as np

In [49]:
dates = pd.date_range('1/1/2000', periods=8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [50]:
df = pd.DataFrame(np.random.randn(8, 4),
   ...:                   index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -1.263342  0.666581  0.484328 -0.631289
2000-01-02 -0.210266  0.669452  0.496605  0.284778
2000-01-03  0.274610 -0.428816 -0.294351  0.955873
2000-01-04 -0.911566  1.020426 -2.228317  0.078700
2000-01-05  0.177414 -0.134870 -1.728240  0.551976
2000-01-06  0.035705 -0.560241  0.526400 -0.642750
2000-01-07 -1.600893  1.655818 -0.480091 -0.374639
2000-01-08 -0.498317 -0.543711 -0.279709  0.931254

In [51]:
s = df['A']

In [52]:
s[dates[5]]

0.03570532497066032

In [53]:
df[['B', 'A']] = df[['A', 'B']]
df

                   A         B         C         D
2000-01-01  0.666581 -1.263342  0.484328 -0.631289
2000-01-02  0.669452 -0.210266  0.496605  0.284778
2000-01-03 -0.428816  0.274610 -0.294351  0.955873
2000-01-04  1.020426 -0.911566 -2.228317  0.078700
2000-01-05 -0.134870  0.177414 -1.728240  0.551976
2000-01-06 -0.560241  0.035705  0.526400 -0.642750
2000-01-07  1.655818 -1.600893 -0.480091 -0.374639
2000-01-08 -0.543711 -0.498317 -0.279709  0.931254

In [54]:
df[['A', 'B']]

                   A         B
2000-01-01  0.666581 -1.263342
2000-01-02  0.669452 -0.210266
2000-01-03 -0.428816  0.274610
2000-01-04  1.020426 -0.911566
2000-01-05 -0.134870  0.177414
2000-01-06 -0.560241  0.035705
2000-01-07  1.655818 -1.600893
2000-01-08 -0.543711 -0.498317

In [55]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]

In [56]:
df[['A', 'B']]

                   A         B
2000-01-01  0.666581 -1.263342
2000-01-02  0.669452 -0.210266
2000-01-03 -0.428816  0.274610
2000-01-04  1.020426 -0.911566
2000-01-05 -0.134870  0.177414
2000-01-06 -0.560241  0.035705
2000-01-07  1.655818 -1.600893
2000-01-08 -0.543711 -0.498317

In [57]:
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()

In [58]:
df[['A', 'B']]

                   A         B
2000-01-01 -1.263342  0.666581
2000-01-02 -0.210266  0.669452
2000-01-03  0.274610 -0.428816
2000-01-04 -0.911566  1.020426
2000-01-05  0.177414 -0.134870
2000-01-06  0.035705 -0.560241
2000-01-07 -1.600893  1.655818
2000-01-08 -0.498317 -0.543711

### Attribute access

In [59]:
sa = pd.Series([1, 2, 3], index=list('abc'))
sa

a    1
b    2
c    3
dtype: int64

In [60]:
dfa = df.copy()
dfa

                   A         B         C         D
2000-01-01 -1.263342  0.666581  0.484328 -0.631289
2000-01-02 -0.210266  0.669452  0.496605  0.284778
2000-01-03  0.274610 -0.428816 -0.294351  0.955873
2000-01-04 -0.911566  1.020426 -2.228317  0.078700
2000-01-05  0.177414 -0.134870 -1.728240  0.551976
2000-01-06  0.035705 -0.560241  0.526400 -0.642750
2000-01-07 -1.600893  1.655818 -0.480091 -0.374639
2000-01-08 -0.498317 -0.543711 -0.279709  0.931254

In [61]:
sa['b'] # or sa.b

2

In [62]:
dfa.A # or dfa['A']

2000-01-01   -1.263342
2000-01-02   -0.210266
2000-01-03    0.274610
2000-01-04   -0.911566
2000-01-05    0.177414
2000-01-06    0.035705
2000-01-07   -1.600893
2000-01-08   -0.498317
Freq: D, Name: A, dtype: float64

In [63]:
sa.a = 5
sa

a    5
b    2
c    3
dtype: int64

In [64]:
dfa.A = list(range(len(dfa.index)))
dfa

            A         B         C         D
2000-01-01  0  0.666581  0.484328 -0.631289
2000-01-02  1  0.669452  0.496605  0.284778
2000-01-03  2 -0.428816 -0.294351  0.955873
2000-01-04  3  1.020426 -2.228317  0.078700
2000-01-05  4 -0.134870 -1.728240  0.551976
2000-01-06  5 -0.560241  0.526400 -0.642750
2000-01-07  6  1.655818 -0.480091 -0.374639
2000-01-08  7 -0.543711 -0.279709  0.931254

In [65]:
dfa['A'] = list(range(len(dfa.index))) # Creating a new column A
dfa

            A         B         C         D
2000-01-01  0  0.666581  0.484328 -0.631289
2000-01-02  1  0.669452  0.496605  0.284778
2000-01-03  2 -0.428816 -0.294351  0.955873
2000-01-04  3  1.020426 -2.228317  0.078700
2000-01-05  4 -0.134870 -1.728240  0.551976
2000-01-06  5 -0.560241  0.526400 -0.642750
2000-01-07  6  1.655818 -0.480091 -0.374639
2000-01-08  7 -0.543711 -0.279709  0.931254

In [66]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [67]:
x.iloc[1] = {'x': 9, 'y': 99}
x

   x   y
0  1   3
1  9  99
2  3   5

In [68]:
dfb = pd.DataFrame({'one': [1., 2., 3.]})
dfb

   one
0  1.0
1  2.0
2  3.0

In [69]:
dfb.two = [4, 5, 6]

C:\Users\abhil\anaconda3\envs\KerasPython37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

### Slicing ranges

In [70]:
s[:5]

2000-01-01   -1.263342
2000-01-02   -0.210266
2000-01-03    0.274610
2000-01-04   -0.911566
2000-01-05    0.177414
Freq: D, Name: A, dtype: float64

In [71]:
 s[::2]

2000-01-01   -1.263342
2000-01-03    0.274610
2000-01-05    0.177414
2000-01-07   -1.600893
Freq: 2D, Name: A, dtype: float64

In [72]:
s[::-1]

2000-01-08   -0.498317
2000-01-07   -1.600893
2000-01-06    0.035705
2000-01-05    0.177414
2000-01-04   -0.911566
2000-01-03    0.274610
2000-01-02   -0.210266
2000-01-01   -1.263342
Freq: -1D, Name: A, dtype: float64

In [73]:
s2 = s.copy()

In [74]:
s2[:5] = 0
s2

2000-01-01    0.000000
2000-01-02    0.000000
2000-01-03    0.000000
2000-01-04    0.000000
2000-01-05    0.000000
2000-01-06    0.035705
2000-01-07   -1.600893
2000-01-08   -0.498317
Freq: D, Name: A, dtype: float64

In [75]:
df[:3]

                   A         B         C         D
2000-01-01 -1.263342  0.666581  0.484328 -0.631289
2000-01-02 -0.210266  0.669452  0.496605  0.284778
2000-01-03  0.274610 -0.428816 -0.294351  0.955873

In [76]:
df[::-1]

                   A         B         C         D
2000-01-08 -0.498317 -0.543711 -0.279709  0.931254
2000-01-07 -1.600893  1.655818 -0.480091 -0.374639
2000-01-06  0.035705 -0.560241  0.526400 -0.642750
2000-01-05  0.177414 -0.134870 -1.728240  0.551976
2000-01-04 -0.911566  1.020426 -2.228317  0.078700
2000-01-03  0.274610 -0.428816 -0.294351  0.955873
2000-01-02 -0.210266  0.669452  0.496605  0.284778
2000-01-01 -1.263342  0.666581  0.484328 -0.631289

### Selection by label

In [77]:
df = pd.DataFrame(np.random.randn(5, 4),
   ....:                    columns=list('ABCD'),
   ....:                    index=pd.date_range('20130101', periods=5))

                   A         B         C         D
2013-01-01  0.079711  1.168447 -0.358891 -0.148874
2013-01-02 -1.802740 -0.445357 -0.798650 -0.317377
2013-01-03 -0.757718 -0.606927  1.017408  0.200015
2013-01-04  0.284260 -1.126983 -0.361774 -0.002129
2013-01-05 -1.315812 -1.122901  0.200381  0.110441

In [79]:
dfl.loc['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.802740 -0.445357 -0.798650 -0.317377
2013-01-03 -0.757718 -0.606927  1.017408  0.200015
2013-01-04  0.284260 -1.126983 -0.361774 -0.002129

In [81]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))
s1

a   -0.177791
b   -0.076336
c    0.391827
d    2.848419
e    0.613649
f    0.998582
dtype: float64

In [82]:
s1.loc['c':]

c    0.391827
d    2.848419
e    0.613649
f    0.998582
dtype: float64

In [83]:
s1.loc['b']

-0.07633625323768804

In [85]:
s1.loc['c':] = 0
s1

a   -0.177791
b   -0.076336
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [87]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))
df1

          A         B         C         D
a -2.759247  1.356175 -1.596958  2.716311
b -0.844450 -0.760568 -0.008846 -0.978212
c  0.875598  0.692285 -0.766874  0.432695
d  1.938683 -1.614065 -0.404342  1.590187
e  1.099397 -1.049892  1.056034  0.018047
f  0.621995 -0.290165 -1.215836 -0.899609

In [88]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a -2.759247  1.356175 -1.596958  2.716311
b -0.844450 -0.760568 -0.008846 -0.978212
d  1.938683 -1.614065 -0.404342  1.590187

In [89]:
df1.loc['d':, 'A':'C']

          A         B         C
d  1.938683 -1.614065 -0.404342
e  1.099397 -1.049892  1.056034
f  0.621995 -0.290165 -1.215836

In [90]:
df1.loc['a']

A   -2.759247
B    1.356175
C   -1.596958
D    2.716311
Name: a, dtype: float64

In [91]:
df1.loc['a'] > 0

A    False
B     True
C    False
D     True
Name: a, dtype: bool

In [92]:
df1.loc[:,df1.loc['a'] > 0]

          B         D
a  1.356175  2.716311
b -0.760568 -0.978212
c  0.692285  0.432695
d -1.614065  1.590187
e -1.049892  0.018047
f -0.290165 -0.899609

In [94]:
mask = pd.array([True, False, True, False, pd.NA, False], dtype="boolean")
mask

<BooleanArray>
[True, False, True, False, <NA>, False]
Length: 6, dtype: boolean

In [95]:
df1[mask]

          A         B         C         D
a -2.759247  1.356175 -1.596958  2.716311
c  0.875598  0.692285 -0.766874  0.432695

In [96]:
df1.loc['a', 'A']

-2.759246655320073

In [97]:
df1.at['a','A']

-2.759246655320073

### Slicing with labels

In [98]:
s = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])
s

0    a
3    b
2    c
5    d
4    e
dtype: object

In [102]:
s.loc[3:5]

3    b
2    c
5    d
dtype: object

In [103]:
s.sort_index()

0    a
2    c
3    b
4    e
5    d
dtype: object

In [104]:
s.sort_index().loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

In [105]:
s = pd.Series(list('abcdef'), index=[0, 3, 2, 5, 4, 2])
s

0    a
3    b
2    c
5    d
4    e
2    f
dtype: object

In [106]:
s.loc[3:5]

3    b
2    c
5    d
dtype: object

### Selection by position